#### Viscosity Property

---

|  |
| --- |
| DuctPressureDropData Class   See Also |

The viscosity of the duct. Units: (kg/(ftÂ·s)).

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double Viscosity { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Viscosity As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Viscosity { 	double get (); } ``` |

# See Also

DuctPressureDropData Class

Autodesk.Revit.DB.Mechanical Namespace